---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RevitLinkType
source: html/4f035f8a-1314-99c2-a05a-f6d5bea0037a.htm
---
# RevitLinkType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.